{"pageProps":{"posts":{"code":"var Component=(()=>{var u=Object.create;var r=Object.defineProperty;var p=Object.getOwnPropertyDescriptor;var g=Object.getOwnPropertyNames;var m=Object.getPrototypeOf,y=Object.prototype.hasOwnProperty;var f=(n,e)=>()=>(e||n((e={exports:{}}).exports,e),e.exports),w=(n,e)=>{for(var i in e)r(n,i,{get:e[i],enumerable:!0})},a=(n,e,i,o)=>{if(e&&typeof e==\"object\"||typeof e==\"function\")for(let s of g(e))!y.call(n,s)&&s!==i&&r(n,s,{get:()=>e[s],enumerable:!(o=p(e,s))||o.enumerable});return n};var v=(n,e,i)=>(i=n!=null?u(m(n)):{},a(e||!n||!n.__esModule?r(i,\"default\",{value:n,enumerable:!0}):i,n)),b=n=>a(r({},\"__esModule\",{value:!0}),n);var h=f((T,l)=>{l.exports=_jsx_runtime});var x={};w(x,{default:()=>d,frontmatter:()=>M});var t=v(h()),M={title:\"My Journey as an LFX Mentee - Exploring E2E Testing with Playwright on Meshery\",date:\"2024-12-10\",cover:\"speed.jpg\",isPublished:!0,description:\"The journey began with a comprehensive exploration of Meshery's existing end-to-end (E2E) testing framework, built using Cypress. Gaining a deep understanding of the existing setup was crucial to ensure a seamless transition to Playwright.\",tags:[\"menthorsip\",\"meshery\"]};function c(n){let e={a:\"a\",h3:\"h3\",li:\"li\",p:\"p\",strong:\"strong\",ul:\"ul\",...n.components};return(0,t.jsxs)(t.Fragment,{children:[(0,t.jsxs)(e.p,{children:[(0,t.jsx)(e.a,{href:\"https://playground.meshery.io/\",children:\"Meshery\"}),\" is an open-source, extensible platform designed to seamlessly integrate with the Kubernetes ecosystem. It is a powerful tool for managing cloud-native infrastructure and applications across multiple cloud providers.\"]}),`\n`,(0,t.jsxs)(e.p,{children:[\"In addition to \",(0,t.jsx)(e.a,{href:\"https://playground.meshery.io/\",children:\"Meshery\"}),\", we are introducing \",(0,t.jsx)(e.a,{href:\"https://kanvas.new/\",children:\"Kanvas\"}),\", an innovative new tool that simplifies and visualizes design processes for managing cloud-native architectures. With Kanvas, users gain an intuitive and graphical interface, making it easier to build, maintain, and share their designs.\"]}),`\n`,(0,t.jsx)(e.h3,{id:\"the-challenge\",children:\"The Challenge\"}),`\n`,(0,t.jsx)(e.p,{children:\"The primary challenge during my mentorship was to migrate the end-to-end (E2E) tests from Cypress to Playwright. This task was essential to ensure that the Meshery project maintained a healthy state across its various integrations. The process involved leveraging Playwright, GitHub Workflows, and self-documenting test reports to automate and sustain Meshery's vast array of integrations.\"}),`\n`,(0,t.jsx)(e.h3,{id:\"the-process\",children:\"The Process\"}),`\n`,(0,t.jsx)(e.p,{children:\"The journey began with a comprehensive exploration of Meshery's existing end-to-end (E2E) testing framework, built using Cypress. Gaining a deep understanding of the existing setup was crucial to ensure a seamless transition to Playwright.\"}),`\n`,(0,t.jsxs)(e.ul,{children:[`\n`,(0,t.jsxs)(e.li,{children:[(0,t.jsx)(e.strong,{children:\"Documentation\"}),\": One of the initial tasks was migrating the contributing guide from Cypress to Playwright. I developed detailed, step-by-step documentation to guide contributors through the Playwright setup and contribution process. This guide now serves as a vital resource for anyone looking to contribute to the Meshery project.\"]}),`\n`,(0,t.jsxs)(e.li,{children:[(0,t.jsx)(e.strong,{children:\"Building Robust Test Reporting\"}),\": A significant milestone was enhancing the test reporter used for pull requests. The improved custom test reporter not only supports inline comments but also logs and stores test artifacts, including traces and videos, via GitHub artifacts for debugging purposes.\"]}),`\n`,(0,t.jsxs)(e.li,{children:[(0,t.jsx)(e.strong,{children:\"Integration into the CI/CD Pipeline\"}),\": The next step involved integrating the Playwright test suite into Meshery's Continuous Integration/Continuous Deployment (CI/CD) pipeline. This integration ensures that all new code changes are consistently tested, maintaining the platform\\u2019s reliability and robustness. We encountered challenges with CI inconsistencies, which we resolved by adjusting timeouts, selecting appropriate GitHub event workflows, and eliminating problematic cache behaviors.\"]}),`\n`,(0,t.jsxs)(e.li,{children:[(0,t.jsx)(e.strong,{children:\"Implementation of Robust Test Cases\"}),\": The final focus was on implementing reliable and comprehensive test cases using Playwright. This step was essential to cover a wide range of Meshery's E2E scenarios, ensuring that all integrations performed as expected under diverse conditions. Test cases were created for multiple environments\\u2014both local setups and Meshery instances. Using Playwright's project capabilities, tests were executed within the same lifecycle, covering nearly 100 relationships in the process.\"]}),`\n`]}),`\n`,(0,t.jsx)(e.h3,{id:\"the-outcome\",children:\"The Outcome\"}),`\n`,(0,t.jsx)(e.p,{children:\"By the end of my mentorship, I achieved the following outcomes:\"}),`\n`,(0,t.jsxs)(e.ul,{children:[`\n`,(0,t.jsx)(e.li,{children:\"Successfully transitioned Meshery's E2E testing framework from Cypress to Playwright.\"}),`\n`,(0,t.jsx)(e.li,{children:\"Created robust documentation that simplifies the contribution process for developers.\"}),`\n`,(0,t.jsx)(e.li,{children:\"Built an enhanced custom test reporter that provides insightful debugging support through logs, traces, and video artifacts.\"}),`\n`,(0,t.jsx)(e.li,{children:\"Seamlessly integrated Playwright into the CI/CD pipeline, resolving inconsistencies and improving the overall reliability of the testing process.\"}),`\n`,(0,t.jsx)(e.li,{children:\"Developed comprehensive test cases that cover diverse scenarios and environments, strengthening the quality assurance process for Meshery.\"}),`\n`]}),`\n`,(0,t.jsx)(e.h3,{id:\"my-mentors\",children:\"My Mentors\"}),`\n`,(0,t.jsx)(e.p,{children:\"This mentorship would not have been successful without the guidance and support of my mentors:\"}),`\n`,(0,t.jsxs)(e.ul,{children:[`\n`,(0,t.jsx)(e.li,{children:(0,t.jsx)(e.a,{href:\"https://layer5.io/community/members/lee-calcote\",children:\"Lee Calcote\"})}),`\n`,(0,t.jsxs)(e.li,{children:[(0,t.jsx)(e.a,{href:\"https://layer5.io/community/members/aabid-sofi\",children:\"Aabid Sofi\"}),`\nTheir expertise, patience, and encouragement played a significant role in helping me navigate the challenges and grow as a developer. I am deeply grateful for their mentorship throughout this journey.`]}),`\n`]}),`\n`,(0,t.jsx)(e.h3,{id:\"conclusion\",children:\"Conclusion\"}),`\n`,(0,t.jsx)(e.p,{children:\"My LFX Mentorship with Meshery has been a testament to the power of open-source collaboration and the impact of robust automation in maintaining complex integrations. This journey has not only enhanced my technical skills but also deepened my appreciation for the open-source community. I am grateful for the opportunity to contribute to Meshery and look forward to continuing my journey in the cloud-native ecosystem.\"})]})}function d(n={}){let{wrapper:e}=n.components||{};return e?(0,t.jsx)(e,{...n,children:(0,t.jsx)(c,{...n})}):c(n)}return b(x);})();\n;return Component;","frontmatter":{"title":"My Journey as an LFX Mentee - Exploring E2E Testing with Playwright on Meshery","date":"2024-12-10","cover":"speed.jpg","isPublished":true,"description":"The journey began with a comprehensive exploration of Meshery's existing end-to-end (E2E) testing framework, built using Cypress. Gaining a deep understanding of the existing setup was crucial to ensure a seamless transition to Playwright.","tags":["menthorsip","meshery"]},"metadata":{"slug":"en-lfx-menthorship","fileName":"en-lfx-menthorship.mdx","blurDataURL":null}},"blurDataURL":null,"currentYear":2025},"__N_SSG":true}