{"pageProps":{"projects":{"code":"var Component=(()=>{var p=Object.create;var r=Object.defineProperty;var g=Object.getOwnPropertyDescriptor;var u=Object.getOwnPropertyNames;var f=Object.getPrototypeOf,m=Object.prototype.hasOwnProperty;var b=(t,e)=>()=>(e||t((e={exports:{}}).exports,e),e.exports),w=(t,e)=>{for(var i in e)r(t,i,{get:e[i],enumerable:!0})},s=(t,e,i,a)=>{if(e&&typeof e==\"object\"||typeof e==\"function\")for(let o of u(e))!m.call(t,o)&&o!==i&&r(t,o,{get:()=>e[o],enumerable:!(a=g(e,o))||a.enumerable});return t};var v=(t,e,i)=>(i=t!=null?p(f(t)):{},s(e||!t||!t.__esModule?r(i,\"default\",{value:t,enumerable:!0}):i,t)),y=t=>s(r({},\"__esModule\",{value:!0}),t);var l=b((k,c)=>{c.exports=_jsx_runtime});var S={};w(S,{default:()=>d,frontmatter:()=>x});var n=v(l()),x={title:\"Personal Web App\",status:\"Under Development\",description:\"Personal Web App is a web application for a portfolio website that maximizes technology such as a progressive web app to target mobile users leverage by caching so user can still get the content while there are offline.\",programming_languange:[\"Typescript\"],cover:\"personal-app.jpeg\",isPublished:!0,repo_url:\"https://github.com/jerensl/www.jerenslensun.com\"};function h(t){let e={br:\"br\",h2:\"h2\",li:\"li\",ol:\"ol\",p:\"p\",ul:\"ul\",...t.components};return(0,n.jsxs)(n.Fragment,{children:[(0,n.jsx)(e.h2,{id:\"overview\",children:\"Overview\"}),`\n`,(0,n.jsx)(e.p,{children:\"Personal Web App is a web application for a portfolio website that maximizes technology such as a progressive web app to target mobile users leverage by caching so user can still get the content while there are offline.\"}),`\n`,(0,n.jsx)(e.h2,{id:\"goals\",children:\"Goals\"}),`\n`,(0,n.jsxs)(e.ol,{children:[`\n`,(0,n.jsxs)(e.li,{children:[\"Personal Branding\",(0,n.jsx)(e.br,{}),`\n`,`As professionals are good to have branding because people can see what are we value and what we are doing,\nbesides that we can get job security and exposure to our project`]}),`\n`,(0,n.jsxs)(e.li,{children:[\"Create the best reading experience for the user\",(0,n.jsx)(e.br,{}),`\n`,`Most of our distractions can come from the internet, but when we don't have any connection to the internet is the best time to get focus to be productive.\nThis is one of the main reasons this website was built using the progressive web app, leveraged by cache so we can still access content offline, another reason is in terms of size web app is smaller than the android app, because they are leverage by a browser itself as their runtime`]}),`\n`,(0,n.jsxs)(e.li,{children:[\"Showcase personal project\",(0,n.jsx)(e.br,{}),`\n`,`Documentation is being a key part of a project, with great documentation,\nI can make other people understand what are I'm doing and what are I'm trying to accomplish with greater context about the situation.`]}),`\n`]}),`\n`,(0,n.jsx)(e.h2,{id:\"features\",children:\"Features\"}),`\n`,(0,n.jsxs)(e.ul,{children:[`\n`,(0,n.jsxs)(e.li,{children:[`\n`,(0,n.jsx)(e.p,{children:\"Blog\"}),`\n`,(0,n.jsxs)(e.ul,{children:[`\n`,(0,n.jsx)(e.li,{children:\"Article on the blog is a primary feature to communicate with the audience especially the developer for sharing an idea or validate my understanding of the concept I studying.\"}),`\n`,(0,n.jsx)(e.li,{children:\"Searching is one of the supporting features to help users to get the content they want faster.\"}),`\n`,(0,n.jsx)(e.li,{children:\"Tagging is one of supporting features for users to access content around the topic of their interest\"}),`\n`]}),`\n`]}),`\n`,(0,n.jsxs)(e.li,{children:[`\n`,(0,n.jsx)(e.p,{children:\"Project\"}),`\n`,(0,n.jsxs)(e.ul,{children:[`\n`,(0,n.jsx)(e.li,{children:\"Project Documentation is one of the primary features of getting opportunities, it will be helpful for potential coworkers, hiring managers, and recruiters about areas of my expertise and the problem I want to solve, and of course for my audience to learn about what decision I have been made.\"}),`\n`]}),`\n`]}),`\n`,(0,n.jsxs)(e.li,{children:[`\n`,(0,n.jsx)(e.p,{children:\"Notification\"}),`\n`,(0,n.jsxs)(e.ul,{children:[`\n`,(0,n.jsx)(e.li,{children:\"Notification is one of the supporting features for users to get noticed about new content on this blog.\"}),`\n`]}),`\n`]}),`\n`]}),`\n`,(0,n.jsx)(e.h2,{id:\"decision\",children:\"Decision\"}),`\n`,(0,n.jsxs)(e.ul,{children:[`\n`,(0,n.jsx)(e.li,{children:`In the context of serving content, facing the need to deliver either blog or project documentation,\nI decided on mdx-bundler against mdxjs to achieve rendering markdown content to HTML,\naccepting that need based on mdxjs not supporting esm module at that time.`}),`\n`,(0,n.jsx)(e.li,{children:`In the context of the framework, facing the need to choose a framework,\nI decided on NextJS against Gatsby to achieve SEO friendly and reduce writing boilerplate which is very painful,\naccepting the need to will cost lower flexibility on configuration.`}),`\n`,(0,n.jsx)(e.li,{children:`In the context of the rendering, facing the need to choose a rendering method,\nI decided on Static Site Generator against Server-side rendering to achieve cost efficiency to use CDN rather than serving on the server,\naccepting the need to will lower the chance to be on top page search engine (SEO Friendly).`}),`\n`]}),`\n`,(0,n.jsx)(e.h2,{id:\"tech-stack\",children:\"Tech Stack\"}),`\n`,(0,n.jsxs)(e.ul,{children:[`\n`,(0,n.jsx)(e.li,{children:\"ReactJS: Widely used framework for web development lifecycle\"}),`\n`,(0,n.jsx)(e.li,{children:\"NextJS: Solving configuration setting to maximize developer experiences\"}),`\n`,(0,n.jsx)(e.li,{children:\"TailwindCss: Making CSS easy to use because of inlining directly to react component\"}),`\n`,(0,n.jsx)(e.li,{children:\"React Testing Library: Solving integration testing within react component\"}),`\n`,(0,n.jsx)(e.li,{children:\"MDX Bundler: Solving parsing markdown file and into HTML using Abstract Syntax Tree(AST)\"}),`\n`,(0,n.jsx)(e.li,{children:\"Msx: Solve mocking api problem\"}),`\n`,(0,n.jsx)(e.li,{children:\"Static Site Generator: Cost relatively cheap or free for limited resources\"}),`\n`,(0,n.jsx)(e.li,{children:\"PWA: Build web app looks like native app leveraged by browser\"}),`\n`]})]})}function d(t={}){let{wrapper:e}=t.components||{};return e?(0,n.jsx)(e,{...t,children:(0,n.jsx)(h,{...t})}):h(t)}return y(S);})();\n;return Component;","frontmatter":{"title":"Personal Web App","status":"Under Development","description":"Personal Web App is a web application for a portfolio website that maximizes technology such as a progressive web app to target mobile users leverage by caching so user can still get the content while there are offline.","programming_languange":["Typescript"],"cover":"personal-app.jpeg","isPublished":true,"repo_url":"https://github.com/jerensl/www.jerenslensun.com"},"metadata":{"slug":"personal-web-app","fileName":"personal-web-app.mdx","blurDataURL":null}},"blurDataURL":null,"currentYear":2025},"__N_SSG":true}